Алгоритм **A\*** (A-star) — это один из самых популярных алгоритмов для поиска кратчайшего пути в графах. Он сочетает в себе преимущества алгоритма Дейкстры (поиск по всем направлениям) и жадного поиска по наилучшему первому шагу (использование эвристики). A\*** эффективен для задач, где известна целевая вершина, и используется в навигации, играх, робототехнике и других областях.

---

### Основные понятия

1. **Граф**:
   - Состоит из **вершин** (узлов) и **рёбер** (соединений между вершинами).
   - Каждое ребро имеет **вес** (стоимость перехода).

2. **Эвристическая функция**:
   - Функция \(h(v)\), которая оценивает стоимость пути от вершины \(v\) до цели.
   - Должна быть **допустимой** (не переоценивать реальную стоимость) и **монотонной**.

3. **Функция оценки**:
   - \(f(v) = g(v) + h(v)\), где:
     - \(g(v)\) — стоимость пути от начальной вершины до \(v\).
     - \(h(v)\) — эвристическая оценка стоимости от \(v\) до цели.

---

### Алгоритм A\***

#### Входные данные:
- Граф \(G = (V, E)\), где \(V\) — множество вершин, \(E\) — множество рёбер.
- Начальная вершина \(start\).
- Целевая вершина \(goal\).
- Веса рёбер \(w(u, v)\) (неотрицательные).
- Эвристическая функция \(h(v)\).

#### Выходные данные:
- Кратчайший путь от \(start\) до \(goal\).
- Стоимость этого пути.

---

### Шаги алгоритма

1. **Инициализация**:
   - Создайте множество **открытых вершин** \(openSet\) и добавьте в него начальную вершину \(start\).
   - Создайте множество **закрытых вершин** \(closedSet\) (изначально пустое).
   - Создайте массив \(g\), где \(g[v]\) — стоимость пути от \(start\) до \(v\) (изначально \(g[start] = 0\), для остальных \(g[v] = \infty\)).
   - Создайте массив \(f\), где \(f[v] = g[v] + h(v)\) (изначально \(f[start] = h(start)\), для остальных \(f[v] = \infty\)).
   - Создайте массив \(prev\), где \(prev[v]\) — предыдущая вершина на пути от \(start\) до \(v\).

2. **Основной цикл**:
   - Пока \(openSet\) не пусто:
     - Извлеките вершину \(u\) с минимальным значением \(f[u]\) из \(openSet\).
     - Если \(u == goal\), завершите алгоритм и восстановите путь.
     - Переместите \(u\) из \(openSet\) в \(closedSet\).
     - Для каждого соседа \(v\) вершины \(u\):
       - Если \(v\) уже в \(closedSet\), пропустите его.
       - Вычислите временное значение \(tempG = g[u] + w(u, v)\).
       - Если \(v\) не в \(openSet\) или \(tempG < g[v]\):
         - Обновите \(prev[v] = u\).
         - Обновите \(g[v] = tempG\).
         - Обновите \(f[v] = g[v] + h(v)\).
         - Если \(v\) не в \(openSet\), добавьте его туда.

3. **Завершение**:
   - Если \(openSet\) пусто, а цель не достигнута, путь не существует.
   - Иначе восстановите путь, начиная с \(goal\) и двигаясь по \(prev\).

---

### Пример работы

Рассмотрим граф:

```
      A
    / | \
  1  4  2
 /   |   \
B    C    D
 \   |   /
  3  1  5
    \ | /
      E
```

- Веса рёбер: \(w(A, B) = 1\), \(w(A, C) = 4\), \(w(A, D) = 2\), \(w(B, E) = 3\), \(w(C, E) = 1\), \(w(D, E) = 5\).
- Эвристическая функция \(h(v)\): \(h(A) = 4\), \(h(B) = 3\), \(h(C) = 1\), \(h(D) = 2\), \(h(E) = 0\).

#### Шаги:
1. Инициализация:
   - \(openSet = [A]\), \(closedSet = []\).
   - \(g = [A: 0, B: \infty, C: \infty, D: \infty, E: \infty]\).
   - \(f = [A: 4, B: \infty, C: \infty, D: \infty, E: \infty]\).

2. Обработка вершины \(A\):
   - Извлекаем \(A\) из \(openSet\).
   - Добавляем \(A\) в \(closedSet\).
   - Обновляем соседей \(B\), \(C\), \(D\):
     - \(B\): \(tempG = 0 + 1 = 1\), \(f[B] = 1 + 3 = 4\).
     - \(C\): \(tempG = 0 + 4 = 4\), \(f[C] = 4 + 1 = 5\).
     - \(D\): \(tempG = 0 + 2 = 2\), \(f[D] = 2 + 2 = 4\).
   - \(openSet = [B, D, C]\).

3. Обработка вершины \(B\):
   - Извлекаем \(B\) из \(openSet\).
   - Добавляем \(B\) в \(closedSet\).
   - Обновляем соседа \(E\):
     - \(E\): \(tempG = 1 + 3 = 4\), \(f[E] = 4 + 0 = 4\).
   - \(openSet = [D, C, E]\).

4. Обработка вершины \(D\):
   - Извлекаем \(D\) из \(openSet\).
   - Добавляем \(D\) в \(closedSet\).
   - Обновляем соседа \(E\):
     - \(E\): \(tempG = 2 + 5 = 7\), \(7 > 4\) (не обновляем).
   - \(openSet = [C, E]\).

5. Обработка вершины \(C\):
   - Извлекаем \(C\) из \(openSet\).
   - Добавляем \(C\) в \(closedSet\).
   - Обновляем соседа \(E\):
     - \(E\): \(tempG = 4 + 1 = 5\), \(5 > 4\) (не обновляем).
   - \(openSet = [E]\).

6. Обработка вершины \(E\):
   - Извлекаем \(E\) из \(openSet\).
   - \(E == goal\), завершаем алгоритм.

#### Результат:
- Кратчайший путь: \(A \rightarrow B \rightarrow E\).
- Стоимость пути: 4.

---

### Реализация на C++

```cpp
#include <iostream>
#include <vector>
#include <queue>
#include <unordered_map>
#include <limits>

using namespace std;

typedef pair<int, int> pii; // (вершина, вес)
typedef pair<int, int> pfi; // (f(v), вершина)

int heuristic(int v, int goal) {
    // Пример эвристической функции (расстояние до цели)
    if (v == 0) return 4; // A
    if (v == 1) return 3; // B
    if (v == 2) return 1; // C
    if (v == 3) return 2; // D
    if (v == 4) return 0; // E
    return 0;
}

void aStar(const vector<vector<pii>>& graph, int start, int goal, vector<int>& path) {
    int n = graph.size();
    vector<int> g(n, numeric_limits<int>::max()); // Стоимость пути от start до v
    vector<int> f(n, numeric_limits<int>::max()); // f(v) = g(v) + h(v)
    vector<int> prev(n, -1); // Предыдущая вершина

    priority_queue<pfi, vector<pfi>, greater<pfi>> openSet; // (f(v), вершина)
    g[start] = 0;
    f[start] = heuristic(start, goal);
    openSet.push({f[start], start});

    while (!openSet.empty()) {
        int u = openSet.top().second;
        openSet.pop();

        if (u == goal) {
            // Восстановление пути
            while (u != -1) {
                path.push_back(u);
                u = prev[u];
            }
            reverse(path.begin(), path.end());
            return;
        }

        for (const auto& edge : graph[u]) {
            int v = edge.first;
            int w = edge.second;

            int tempG = g[u] + w;
            if (tempG < g[v]) {
                prev[v] = u;
                g[v] = tempG;
                f[v] = g[v] + heuristic(v, goal);
                openSet.push({f[v], v});
            }
        }
    }
}

int main() {
    int n = 5; // Количество вершин
    vector<vector<pii>> graph(n);

    // Добавляем рёбра
    graph[0].push_back({1, 1}); // A -> B (вес 1)
    graph[0].push_back({2, 4}); // A -> C (вес 4)
    graph[0].push_back({3, 2}); // A -> D (вес 2)
    graph[1].push_back({4, 3}); // B -> E (вес 3)
    graph[2].push_back({4, 1}); // C -> E (вес 1)
    graph[3].push_back({4, 5}); // D -> E (вес 5)

    vector<int> path;
    aStar(graph, 0, 4, path);

    // Вывод пути
    cout << "Кратчайший путь: ";
    for (int v : path) {
        cout << v << " ";
    }
    cout << endl;

    return 0;
}
```

---

### Сложность алгоритма

- **Время**: Зависит от эвристики. В худшем случае \(O(b^d)\), где \(b\) — ветвящийся фактор, \(d\) — глубина решения.
- **Память**: \(O(V)\) для хранения \(openSet\) и \(closedSet\).

---

### Преимущества и недостатки

#### Преимущества:
- Эффективен для задач с известной целью.
- Использует эвристику для ускорения поиска.

#### Недостатки:
- Требует хорошей эвристической функции.
- Может быть неэффективен для больших графов, если эвристика слабая.

---

Если у вас есть вопросы или нужно больше примеров, дайте знать! 😊