Алгоритм Дейкстры — это один из самых известных алгоритмов для нахождения **кратчайшего пути** от одной вершины (источника) до всех остальных вершин в графе с **неотрицательными весами рёбер**. Он был разработан нидерландским ученым Эдсгером Дейкстрой в 1959 году. Алгоритм широко используется в навигации, маршрутизации и других задачах, где требуется найти оптимальный путь.

---

### Основные понятия

1. **Граф**:
   - Состоит из **вершин** (узлов) и **рёбер** (соединений между вершинами).
   - Каждое ребро имеет **вес** (стоимость перехода).

2. **Кратчайший путь**:
   - Путь с минимальной суммой весов рёбер между двумя вершинами.

3. **Расстояние**:
   - Сумма весов рёбер на пути от начальной вершины до текущей.

---

### Алгоритм Дейкстры

#### Входные данные:
- Граф \(G = (V, E)\), где \(V\) — множество вершин, \(E\) — множество рёбер.
- Начальная вершина \(s\) (источник).
- Веса рёбер \(w(u, v)\) (неотрицательные).

#### Выходные данные:
- Массив \(dist\), где \(dist[v]\) — кратчайшее расстояние от \(s\) до \(v\).
- Массив \(prev\), где \(prev[v]\) — предыдущая вершина на пути от \(s\) до \(v\).

---

### Шаги алгоритма

1. **Инициализация**:
   - Создайте массив \(dist\) и установите \(dist[s] = 0\) (расстояние до начальной вершины равно 0).
   - Для всех остальных вершин \(v \in V\) установите \(dist[v] = \infty\) (бесконечность).
   - Создайте пустой массив \(prev\).
   - Создайте приоритетную очередь \(Q\) (кучу), где вершины упорядочены по значению \(dist\).

2. **Основной цикл**:
   - Пока очередь \(Q\) не пуста:
     - Извлеките вершину \(u\) с минимальным значением \(dist[u]\) из \(Q\).
     - Для каждого соседа \(v\) вершины \(u\):
       - Вычислите новое расстояние: \(alt = dist[u] + w(u, v)\).
       - Если \(alt < dist[v]\):
         - Обновите расстояние: \(dist[v] = alt\).
         - Обновите предыдущую вершину: \(prev[v] = u\).
         - Добавьте \(v\) в очередь \(Q\) (или обновите её приоритет).

3. **Завершение**:
   - Алгоритм завершается, когда все вершины обработаны.
   - Массив \(dist\) содержит кратчайшие расстояния от \(s\) до всех вершин.
   - Массив \(prev\) позволяет восстановить кратчайший путь.

---

### Пример работы

Рассмотрим граф:

```
      A
    / | \
  1  4  2
 /   |   \
B    C    D
 \   |   /
  3  1  5
    \ | /
      E
```

- Веса рёбер: \(w(A, B) = 1\), \(w(A, C) = 4\), \(w(A, D) = 2\), \(w(B, E) = 3\), \(w(C, E) = 1\), \(w(D, E) = 5\).

#### Шаги:
1. Инициализация:
   - \(dist = [A: 0, B: \infty, C: \infty, D: \infty, E: \infty]\).
   - \(Q = [A]\).

2. Обработка вершины \(A\):
   - Обновляем расстояния до \(B\), \(C\), \(D\):
     - \(dist[B] = 1\), \(dist[C] = 4\), \(dist[D] = 2\).
   - \(Q = [B, D, C]\).

3. Обработка вершины \(B\):
   - Обновляем расстояние до \(E\):
     - \(dist[E] = 1 + 3 = 4\).
   - \(Q = [D, C, E]\).

4. Обработка вершины \(D\):
   - Расстояние до \(E\) через \(D\): \(2 + 5 = 7\) (не обновляем, так как \(7 > 4\)).
   - \(Q = [C, E]\).

5. Обработка вершины \(C\):
   - Расстояние до \(E\) через \(C\): \(4 + 1 = 5\) (не обновляем, так как \(5 > 4\)).
   - \(Q = [E]\).

6. Обработка вершины \(E\):
   - Все вершины обработаны.

#### Результат:
- \(dist = [A: 0, B: 1, C: 4, D: 2, E: 4]\).
- Кратчайший путь от \(A\) до \(E\): \(A \rightarrow B \rightarrow E\).

---

### Реализация на C++

```cpp
#include <iostream>
#include <vector>
#include <queue>
#include <limits>

using namespace std;

typedef pair<int, int> pii; // (вес, вершина)

void dijkstra(const vector<vector<pii>>& graph, int start, vector<int>& dist, vector<int>& prev) {
    int n = graph.size();
    dist.assign(n, numeric_limits<int>::max());
    prev.assign(n, -1);

    priority_queue<pii, vector<pii>, greater<pii>> pq; // (вес, вершина)
    dist[start] = 0;
    pq.push({0, start});

    while (!pq.empty()) {
        int u = pq.top().second;
        int d = pq.top().first;
        pq.pop();

        if (d > dist[u]) continue; // Пропускаем устаревшие записи

        for (const auto& edge : graph[u]) {
            int v = edge.first;
            int w = edge.second;

            if (dist[u] + w < dist[v]) {
                dist[v] = dist[u] + w;
                prev[v] = u;
                pq.push({dist[v], v});
            }
        }
    }
}

int main() {
    int n = 5; // Количество вершин
    vector<vector<pii>> graph(n);

    // Добавляем рёбра
    graph[0].push_back({1, 1}); // A -> B (вес 1)
    graph[0].push_back({2, 4}); // A -> C (вес 4)
    graph[0].push_back({3, 2}); // A -> D (вес 2)
    graph[1].push_back({4, 3}); // B -> E (вес 3)
    graph[2].push_back({4, 1}); // C -> E (вес 1)
    graph[3].push_back({4, 5}); // D -> E (вес 5)

    vector<int> dist, prev;
    dijkstra(graph, 0, dist, prev);

    // Вывод результатов
    for (int i = 0; i < n; ++i) {
        cout << "Расстояние до вершины " << i << ": " << dist[i] << endl;
    }

    return 0;
}
```

---

### Сложность алгоритма

- **Время**: \(O((V + E) \log V)\) с использованием приоритетной очереди (кучи).
- **Память**: \(O(V + E)\) для хранения графа и вспомогательных структур.

---

### Преимущества и недостатки

#### Преимущества:
- Эффективен для графов с неотрицательными весами.
- Гарантирует нахождение кратчайшего пути.

#### Недостатки:
- Не работает с отрицательными весами.
- Требует дополнительной памяти для хранения графа и очереди.

---

Если у вас есть вопросы или нужно больше примеров, дайте знать! 😊